app/views/admin/templates/edit.html.erb

<script>
  let questionIndex = <%= @template.questions.size %>;
---
SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = $1  [["template_id", 10]]