app/views/admin/templates/index.html.erb

          position: relative;
          border-left: 4px solid <%= template.formularios.any? ? '#ff9800' : '#4CAF50' %>;
---
SELECT 1 AS one FROM "formularios" WHERE "formularios"."template_id" = $1 LIMIT $2  [["template_id", 5], ["LIMIT", 1]]

        <p class="text-muted" style="margin: 0 0 4px 0; font-size: 0.9rem;">
          <strong><%= template.questions.count %></strong> pergunta(s)
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."template_id" = $1  [["template_id", 5]]