app/views/admin/templates/index.html.erb

          position: relative;
          border-left: 4px solid <%= template.formularios.any? ? '#ff9800' : '#4CAF50' %>;
---
SELECT 1 AS one FROM "formularios" WHERE "formularios"."template_id" = 3 LIMIT 1

        <p class="text-muted" style="margin: 0 0 4px 0; font-size: 0.9rem;">
          <strong><%= template.questions.count %></strong> pergunta(s)
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."template_id" = 3

        <p class="text-muted" style="margin: 0 0 16px 0; font-size: 0.9rem;">
          <strong><%= template.formularios.count %></strong> formulário(s)
---
SELECT COUNT(*) FROM "formularios" WHERE "formularios"."template_id" = 3


        <% if template.formularios.any? %>
---
SELECT 1 AS one FROM "formularios" WHERE "formularios"."template_id" = 3 LIMIT 1

          <!-- DELETAR -->
          <%= button_to admin_template_path(template),
              method: :delete,
              form: { data: { turbo_confirm: template.formularios.any? ? "⚠️ ATENÇÃO: Este template está associado a #{template.formularios.count} formulário(s). Ao excluir, todos serão removidos. Tem certeza?" : "Tem certeza que deseja excluir?" }, class: "d-inline" },
              style: "flex: 1; background: #ffebee; color: #c62828; border: none; padding: 8px; border-radius: 4px; cursor: pointer; font-weight: 500; font-size: 0.9rem;" do %>
---
SELECT 1 AS one FROM "formularios" WHERE "formularios"."template_id" = 3 LIMIT 1