app/views/admin/templates/show.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."template_id" = $1  [["template_id", 6]]
---
    <p>
      <strong>Perguntas:</strong> <%= @template.questions.count %>

SELECT COUNT(*) FROM "formularios" WHERE "formularios"."template_id" = $1  [["template_id", 6]]
---
    <p>
      <strong>Formulários associados:</strong> <%= @template.formularios.count %>