app/views/admin/templates/show.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."template_id" = 4
---
    <p>
      <strong>Perguntas:</strong> <%= @template.questions.count %>

SELECT COUNT(*) FROM "formularios" WHERE "formularios"."template_id" = 4
---
    <p>
      <strong>Formulários associados:</strong> <%= @template.formularios.count %>

SELECT COUNT(*) FROM "formularios" WHERE "formularios"."template_id" = 4
---
      <%= link_to "Editar", edit_admin_template_path(@template), class: "btn btn-primary me-2" %>
      <%= button_to "Excluir", admin_template_path(@template),
            method: :delete,
            form: { data: { turbo_confirm: "⚠️ ATENÇÃO: Ao excluir este template, todos os #{@template.formularios.count} formulário(s) associado(s) também serão excluído(s). Tem certeza?" }, class: "d-inline" },
            class: "btn btn-danger me-2" %>