app/services/turma_import_service.rb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."codigo" = 'CIC0101' LIMIT 1
INSERT INTO "turmas" ("codigo", "departamento", "semestre", "created_at", "updated_at", "professor") VALUES ('CIC0101', 'Departamento de Computação', '2024.1', '2025-12-11 19:59:45.160012', '2025-12-11 19:59:45.160012', 'Prof. Ana Souza') RETURNING "id"
---
  def call
    return failure("Arquivo não enviado.") if @file.nil?

    csv_text = @file.read
    return failure("Arquivo CSV vazio.") if csv_text.strip.empty?

    col_sep = csv_text.include?(";") ? ";" : ","
    table = CSV.parse(csv_text, headers: true, col_sep: col_sep)
    return failure("Arquivo CSV sem linhas de dados.") if table.empty?

    created_turmas = 0
    created_users = 0
    existing_users = 0
    errors = []
    turma_cache = {}

    table.each_with_index do |row, idx|
      data = normalize_row(row)
      missing = REQUIRED_FIELDS.select { |field| data[field].blank? }
      if missing.any?
        errors << "Linha #{idx + 2}: campos obrigatórios ausentes: #{missing.join(', ')}"
        next
      end

      turma = turma_cache[data["codigo"]] ||= Turma.find_or_initialize_by(codigo: data["codigo"])
      if turma.new_record?
        turma.departamento = data["departamento"]
        turma.semestre = data["semestre"]
        turma.professor = data["professor"]
        unless turma.save
          errors << "Linha #{idx + 2}: turma #{data['codigo']} - #{turma.errors.full_messages.to_sentence}"

SELECT "users".* FROM "users" WHERE "users"."matricula" = '202212345' LIMIT 1
---
        )
      end

      user = User.find_or_initialize_by(matricula: data["matricula"])

INSERT INTO "users" ("nome", "email", "matricula", "password_digest", "role", "created_at", "updated_at") VALUES ('João Pereira', 'joao.pereira@aluno.unb.br', '202212345', '$2a$12$B6WeIucTMKuhcj2S3nuex.M93zf13sGm2DiQm2l0yLp1l9eq1WLR.', 'participante', '2025-12-11 19:59:47.011859', '2025-12-11 19:59:47.011859') RETURNING "id"
---
        password = data["senha"].presence || data["matricula"].presence || SecureRandom.alphanumeric(10)
        user.password = password
        user.password_confirmation = password
        unless user.save

INSERT INTO "turma_users" ("user_id", "turma_id", "created_at", "updated_at") VALUES (4, 5, '2025-12-11 19:59:49.309625', '2025-12-11 19:59:49.309625') RETURNING "id"
SELECT "turma_users".* FROM "turma_users" WHERE "turma_users"."turma_id" = 5 AND "turma_users"."user_id" = 4 LIMIT 1
---
        existing_users += 1
      end

      turma.turma_users.find_or_create_by(user: user)