app/services/turma_import_service.rb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."codigo" = 'CIC101' LIMIT 1
INSERT INTO "turmas" ("codigo", "created_at", "departamento", "professor", "semestre", "updated_at") VALUES ('CIC101', '2025-12-12 20:33:12.408299', 'CIC', 'Prof. Ana Silva', '2025.1', '2025-12-12 20:33:12.408299') RETURNING "id"
SELECT 1 AS one FROM "turmas" WHERE "turmas"."codigo" = 'CIC101' LIMIT 1
---
  def find_or_create_turma(data, turma_cache, idx, errors)
    turma = turma_cache[data["codigo"]] ||= Turma.find_or_initialize_by(codigo: data["codigo"])
    created_inc = 0
    if turma.new_record?
      turma.departamento = data["departamento"]
      turma.semestre = data["semestre"]
      turma.professor = data["professor"]
      unless turma.save
        errors << format_errors(data['codigo'], idx, 'turma') { turma.errors.full_messages.to_sentence }
        turma_cache.delete(data["codigo"])
        return nil
      end
      created_inc = 1
    else
      # Atualiza somente se há novos valores
      updates = {}
      updates[:departamento] = data["departamento"] if data["departamento"].present? && data["departamento"] != turma.departamento

INSERT INTO "turma_users" ("created_at", "turma_id", "updated_at", "user_id") VALUES ('2025-12-12 20:33:16.529644', 268, '2025-12-12 20:33:16.529644', 379) RETURNING "id"
SELECT "turma_users".* FROM "turma_users" WHERE "turma_users"."turma_id" = 268 AND "turma_users"."user_id" = 379 LIMIT 1
---
  def link_user_to_turma(turma, user)
    turma.turma_users.find_or_create_by(user: user)