app/controllers/admin/formularios_controller.rb

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 6 LIMIT 1
---
  def show
    @formulario = Formulario.find(params[:id])

INSERT INTO "formularios" ("template_id", "turma_id", "publico_alvo", "status", "created_at", "updated_at", "titulo", "descricao") VALUES (3, 2, NULL, 0, '2025-12-11 19:00:20.145871', '2025-12-11 19:00:20.145871', 'Engenharia de Software', NULL) RETURNING "id"
---
  def create
    @formulario = Formulario.new(formulario_params)
    @formulario.template ||= default_template
    @formulario.turma ||= default_turma
    if @formulario.save

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 1 LIMIT 1
---
  def edit
    @formulario = Formulario.find(params[:id])

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 6 LIMIT 1
UPDATE "formularios" SET "template_id" = 5, "updated_at" = '2025-12-11 19:00:39.746706' WHERE "formularios"."id" = 6
---
  def update
    @formulario = Formulario.find(params[:id])
    if @formulario.update(formulario_params)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 188 LIMIT 1
DELETE FROM "formularios" WHERE "formularios"."id" = 6
---
  def destroy
    @formulario = Formulario.find(params[:id])
    @formulario.destroy

SELECT "templates".* FROM "templates" WHERE "templates"."nome" = 'Template padrão' LIMIT 1
---
  def default_template
    ::Template.find_or_create_by!(nome: "Template padrão") do |template|

SELECT "turmas".* FROM "turmas" WHERE "turmas"."codigo" = 'TURMA-PADRAO' LIMIT 1
---
  def default_turma
    ::Turma.find_or_create_by!(codigo: "TURMA-PADRAO") do |turma|