app/controllers/admin/formularios_controller.rb

SELECT "formularios".* FROM "formularios"
---
  def index
    @formularios = Formulario.all

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @formulario = Formulario.find(params[:id])

INSERT INTO "formularios" ("created_at", "descricao", "publico_alvo", "status", "template_id", "titulo", "turma_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @formulario = Formulario.new(formulario_params)
    @formulario.template ||= default_template
    @formulario.turma ||= default_turma
    if @formulario.save

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @formulario = Formulario.find(params[:id])

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "formularios" SET "titulo" = $1, "updated_at" = $2 WHERE "formularios"."id" = $3  [["titulo", "Avaliação Atualizada"], ["updated_at", "2025-12-12 02:29:30.051831"], ["id", 11]]
---
  def update
    @formulario = Formulario.find(params[:id])
    if @formulario.update(formulario_params)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "formularios" WHERE "formularios"."id" = $1  [["id", 12]]
---
  def destroy
    @formulario = Formulario.find(params[:id])
    @formulario.destroy

SELECT "templates".* FROM "templates"
SELECT "turmas".* FROM "turmas"
---
  def load_collections
    @templates = ::Template.all
    @turmas = ::Turma.all