app/controllers/admin/formularios_controller.rb

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 189 LIMIT 1
---
  def respostas
    @formulario = Formulario.find(params[:id])

SELECT "respostas"."valor" FROM "respostas" WHERE "respostas"."formulario_id" = 189 AND "respostas"."question_id" = 80
---
  def agrupar_respostas_por_pergunta(formulario, perguntas)
    respostas = {}
    perguntas.each do |pergunta|
      valores = formulario.respostas.where(question_id: pergunta.id).pluck(:valor)

SELECT COUNT(DISTINCT "respostas"."user_id") FROM "respostas" WHERE "respostas"."formulario_id" = 189
---
  def contar_respondentes(formulario)
    formulario.respostas.select(:user_id).distinct.count