app/controllers/admin/formularios_controller.rb

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def respostas
    @formulario = Formulario.find(params[:id])