app/controllers/admin/perfil_controller.rb

    def update_password
      @user = current_user

      unless @user.authenticate(params[:current_password])
        flash.now[:alert] = "Senha atual incorreta."
        render :edit_password, status: :unprocessable_entity
        return
      end

      if params[:new_password] != params[:password_confirmation]
        flash.now[:alert] = "A nova senha e a confirmação não coincidem."
        render :edit_password, status: :unprocessable_entity
        return
      end

      if @user.update(password: params[:new_password], password_confirmation: params[:password_confirmation])
---
UPDATE "users" SET "password_digest" = '$2a$12$YONXHeXgSvGZFbDLmD9pFes91S9NuQ70.LeUu01Zxo1BU0tj0wN7S', "updated_at" = '2025-12-12 21:26:43.865365' WHERE "users"."id" = 228