app/controllers/admin/templates_controller.rb

SELECT "templates".* FROM "templates"
---
    def index
      @templates = ::Template.all

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
      @template = ::Template.find(params[:id])

INSERT INTO "templates" ("created_at", "descricao", "nome", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2025-12-12 02:28:49.522331"], ["descricao", nil], ["nome", "Template Novo"], ["updated_at", "2025-12-12 02:28:49.522331"]]
---
    def create
      @template = ::Template.new(template_params)
      if @template.save

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def edit
      @template = ::Template.find(params[:id])

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "templates" SET "nome" = $1, "updated_at" = $2 WHERE "templates"."id" = $3  [["nome", "Template Atualizado"], ["updated_at", "2025-12-12 02:28:56.340440"], ["id", 11]]
---
    def update
      @template = ::Template.find(params[:id])
      if @template.update(template_params)

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "templates" WHERE "templates"."id" = $1  [["id", 12]]
---
    def destroy
      @template = ::Template.find(params[:id])
      @template.destroy