app/controllers/admin/templates_controller.rb

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 4 LIMIT 1
---
    def show
      @template = ::Template.find(params[:id])

INSERT INTO "templates" ("nome", "descricao", "created_at", "updated_at") VALUES ('Teste', NULL, '2025-12-11 18:37:56.641930', '2025-12-11 18:37:56.641930') RETURNING "id"
---
    def create
      @template = ::Template.new(template_params)
      if @template.save

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1
---
    def edit
      @template = ::Template.find(params[:id])

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 3 LIMIT 1
UPDATE "templates" SET "nome" = 'Template padrãodsd', "descricao" = 'Gerado automaticamentedsds', "updated_at" = '2025-12-11 15:26:46.164001' WHERE "templates"."id" = 1
---
    def update
      @template = ::Template.find(params[:id])
      if @template.update(template_params)

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 251 LIMIT 1
DELETE FROM "templates" WHERE "templates"."id" = 2
---
    def destroy
      @template = ::Template.find(params[:id])
      @template.destroy