app/controllers/admin/turmas_controller.rb

SELECT "turmas".* FROM "turmas"
---
    def index
      @turmas = ::Turma.all

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def show
      @turma = ::Turma.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "participante"]]
---
    def new
      @turma = ::Turma.new
      @alunos_disponiveis = ::User.where(role: "participante")

INSERT INTO "turmas" ("codigo", "created_at", "departamento", "professor", "semestre", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["codigo", "T02"], ["created_at", "2025-12-12 03:00:32.621099"], ["departamento", "DEP2"], ["professor", "Prof Y"], ["semestre", "2024.2"], ["updated_at", "2025-12-12 03:00:32.621099"]]
SELECT 1 AS one FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = $1 LIMIT $2  [["user_id", 227], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "participante"]]
---
    def create
      @turma = ::Turma.new(turma_params)
      if @turma.save
        # Associar alunos selecionados
        if params[:turma][:aluno_ids].present?
          params[:turma][:aluno_ids].each do |aluno_id|
            @turma.turma_users.create(user_id: aluno_id) unless aluno_id.blank?
          end
        end
        redirect_to admin_turmas_path, notice: "Turma criada com sucesso!"
      else
        @alunos_disponiveis = ::User.where(role: "participante")

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "participante"]]
---
    def edit
      @turma = ::Turma.find(params[:id])
      @alunos_disponiveis = ::User.where(role: "participante")

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "turmas" SET "professor" = $1, "updated_at" = $2 WHERE "turmas"."id" = $3  [["professor", "Prof Atualizado"], ["updated_at", "2025-12-12 03:00:43.077980"], ["id", 19]]
SELECT "turma_users".* FROM "turma_users" WHERE "turma_users"."turma_id" = $1  [["turma_id", 19]]
SELECT 1 AS one FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = $1 LIMIT $2  [["user_id", 227], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "participante"]]
---
    def update
      @turma = ::Turma.find(params[:id])
      if @turma.update(turma_params)
        # Atualizar alunos da turma
        # Primeiro, remover todas as associações
        @turma.turma_users.destroy_all
        # Depois, adicionar os selecionados
        if params[:turma][:aluno_ids].present?
          params[:turma][:aluno_ids].each do |aluno_id|
            @turma.turma_users.create(user_id: aluno_id) unless aluno_id.blank?
          end
        end
        redirect_to admin_turmas_path, notice: "Turma atualizada!"
      else
        @alunos_disponiveis = ::User.where(role: "participante")

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "turmas" WHERE "turmas"."id" = $1  [["id", 21]]
---
    def destroy
      @turma = ::Turma.find(params[:id])
      @turma.destroy