app/controllers/admin/turmas_controller.rb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1
---
    def show
      @turma = ::Turma.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."role" = 'participante' AND "users"."turma_id" IS NULL
---
    def new
      @turma = ::Turma.new
      @alunos_disponiveis = ::User.where(role: "participante")

INSERT INTO "turmas" ("codigo", "departamento", "semestre", "created_at", "updated_at", "professor") VALUES ('adsad', 'dasdas', '2023/1', '2025-12-11 19:23:02.342880', '2025-12-11 19:23:02.342880', 'dsads') RETURNING "id"
INSERT INTO "turma_users" ("user_id", "turma_id", "created_at", "updated_at") VALUES (3, 4, '2025-12-11 19:27:08.419640', '2025-12-11 19:27:08.419640') RETURNING "id"
SELECT 1 AS one FROM "turma_users" WHERE "turma_users"."user_id" = 3 AND "turma_users"."turma_id" = 4 LIMIT 1
---
    def create
      @turma = ::Turma.new(turma_params)
      if @turma.save
        # Associar alunos selecionados
        if params[:turma][:aluno_ids].present?
          params[:turma][:aluno_ids].each do |aluno_id|
            @turma.turma_users.create(user_id: aluno_id) unless aluno_id.blank?

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."role" = 'participante' AND "users"."turma_id" IS NULL
---
    def edit
      @turma = ::Turma.find(params[:id])
      @alunos_disponiveis = ::User.where(role: "participante")

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 3 LIMIT 1
UPDATE "turmas" SET "codigo" = 'CIC202', "departamento" = 'CIC', "updated_at" = '2025-12-12 20:36:10.907388' WHERE "turmas"."id" = 269
DELETE FROM "turma_users" WHERE "turma_users"."id" = 55
DELETE FROM "turmas" WHERE "turmas"."id" = 3
INSERT INTO "turma_users" ("created_at", "turma_id", "updated_at", "user_id") VALUES ('2025-12-12 20:36:15.469760', 269, '2025-12-12 20:36:15.469760', 384) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT 1 AS one FROM "turma_users" WHERE "turma_users"."user_id" = 384 AND "turma_users"."turma_id" = 269 LIMIT 1
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 4 LIMIT 1
---
    def update
      @turma = ::Turma.find(params[:id])
      if @turma.update(turma_params)
        # Atualizar alunos da turma
        # Primeiro, remover todas as associações
        @turma.turma_users.destroy_all
        # Depois, adicionar os selecionados
        if params[:turma][:aluno_ids].present?
          params[:turma][:aluno_ids].each do |aluno_id|
            @turma.turma_users.create(user_id: aluno_id) unless aluno_id.blank?

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 268 LIMIT 1
---
    def destroy
      @turma = ::Turma.find(params[:id])

INSERT INTO "turmas" ("codigo", "departamento", "semestre", "created_at", "updated_at", "professor") VALUES ('CIC0101', 'Departamento de Computação', '2024.1', '2025-12-11 19:59:45.160012', '2025-12-11 19:59:45.160012', 'Prof. Ana Souza') RETURNING "id"
INSERT INTO "users" ("nome", "email", "matricula", "password_digest", "role", "created_at", "updated_at") VALUES ('João Pereira', 'joao.pereira@aluno.unb.br', '202212345', '$2a$12$B6WeIucTMKuhcj2S3nuex.M93zf13sGm2DiQm2l0yLp1l9eq1WLR.', 'participante', '2025-12-11 19:59:47.011859', '2025-12-11 19:59:47.011859') RETURNING "id"
---
    def import
      if params[:file].blank?
        redirect_to import_form_admin_turmas_path, alert: "Envie um arquivo CSV para importar." and return
      end

      result = ::TurmaImportService.new(file: params[:file]).call

      if result.success?
        msg = "Importação concluída. Turmas novas: #{result.created_turmas}. Alunos novos: #{result.created_users}. Alunos já existentes: #{result.existing_users}."