app/controllers/admin/turmas_controller.rb

    def index
      @turmas = ::Turma.includes(:users).all
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25)

    def load_turma
      @turma = ::Turma.includes(:users, :turma_users).find(params[:id])
---
SELECT "turma_users".* FROM "turma_users" WHERE "turma_users"."turma_id" IN ($1, $2, $3, $4, $5, $6)  [["turma_id", 268], ["turma_id", 269], ["turma_id", 270], ["turma_id", 271], ["turma_id", 272], ["turma_id", 335]]
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) AS "count_all", "turma_users"."user_id" AS "turma_users_user_id" FROM "turma_users" WHERE "turma_users"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26) GROUP BY "turma_users"."user_id"