app/controllers/admin/turmas_controller.rb

    def update
      @turma = ::Turma.find(params[:id])
      if @turma.update(turma_params)
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1
UPDATE "turmas" SET "codigo" = 't4323', "updated_at" = '2025-12-11 15:25:18.436223' WHERE "turmas"."id" = 2

    def destroy
      @turma = ::Turma.find(params[:id])
      @turma.destroy
---
DELETE FROM "turmas" WHERE "turmas"."id" = 1