app/controllers/admin/turmas_controller.rb

    def create
      @turma = ::Turma.new(turma_params)
      if @turma.save
---
INSERT INTO "turmas" ("codigo", "departamento", "semestre", "created_at", "updated_at") VALUES ('t4', 'dasdsa', 'd3213', '2025-12-11 15:25:11.448928', '2025-12-11 15:25:11.448928') RETURNING "id"

    def load_turma
      @turma = ::Turma.includes(:users, :turma_users).find(params[:id])
---
SELECT "turma_users".* FROM "turma_users" WHERE "turma_users"."turma_id" = 269
SELECT "users".* FROM "users" WHERE "users"."id" IN (384, 385, 386, 387, 388)

    def associar_alunos(turma, aluno_ids)
      return if aluno_ids.blank?
      aluno_ids.each do |aluno_id|
        next if aluno_id.blank?
        turma.turma_users.create(user_id: aluno_id)
---
INSERT INTO "turma_users" ("created_at", "turma_id", "updated_at", "user_id") VALUES ('2025-12-12 20:36:15.469760', 269, '2025-12-12 20:36:15.469760', 384) RETURNING "id"

    def preparar_listas_turma(turma = nil)
      @alunos_disponiveis = ::User.where(role: "participante").select(:id, :nome, :matricula, :email).order(:nome)
      @professores = ::User.where(role: "administrador").select(:id, :nome, :email).order(:nome)
      @alunos_da_turma = turma&.users if turma

      # Pré-calcular contagem de turmas para evitar N+1 na view
      aluno_ids = @alunos_disponiveis.pluck(:id)
      @turmas_por_aluno = TurmaUser.where(user_id: aluno_ids)
                                    .group(:user_id)
                                    .count
---
SELECT "users"."id" FROM "users" WHERE "users"."role" = 'participante' ORDER BY "users"."nome" ASC
SELECT COUNT(*) AS "count_all", "turma_users"."user_id" AS "turma_users_user_id" FROM "turma_users" WHERE "turma_users"."user_id" IN (227, 384, 398, 382, 393, 386, 400, 387, 399, 391, 388, 403, 396, 379, 390, 392, 381, 380, 402, 394, 385, 383, 395, 397, 389, 401) GROUP BY "turma_users"."user_id"

    def redefinir_associacoes_alunos(turma, aluno_ids)
      turma.turma_users.destroy_all
---
DELETE FROM "turma_users" WHERE "turma_users"."id" = 15