app/services/users/upsert_from_csv.rb

SELECT "users".* FROM "users" WHERE "users"."matricula" = '2025001' LIMIT 1
---
    def call
      user = ::User.find_or_initialize_by(matricula: @data["matricula"])

INSERT INTO "users" ("created_at", "email", "matricula", "nome", "password_digest", "role", "updated_at") VALUES ('2025-12-12 20:33:14.408494', 'joao.pereira@aluno.unb.br', '2025001', 'João Pereira', '$2a$12$/pTEQifugl9.EgEccHReMOgEyCV6ur.3WlFEOQkUX2ra87GpTuqXK', 'participante', '2025-12-12 20:33:14.408494') RETURNING "id"
---
    def save_new_user(user)
      if user.save