app/views/admin/turmas/index.html.erb

        <p class="text-muted" style="margin: 0 0 16px 0; font-size: 0.85rem;">
          <strong><%= turma.users.count %></strong> aluno(s)
---
SELECT COUNT(*) FROM "users" INNER JOIN "turma_users" ON "users"."id" = "turma_users"."user_id" WHERE "turma_users"."turma_id" = $1  [["turma_id", 12]]