app/views/admin/turmas/show.html.erb

      <strong>Total de Alunos:</strong>
      <span><%= @turma.users.count %></span>
---
SELECT "users".* FROM "users" INNER JOIN "turma_users" ON "users"."id" = "turma_users"."user_id" WHERE "turma_users"."turma_id" = 6
SELECT COUNT(*) FROM "users" INNER JOIN "turma_users" ON "users"."id" = "turma_users"."user_id" WHERE "turma_users"."turma_id" = 6

  <!-- Lista de Alunos -->
  <% if @turma.users.any? %>
---
SELECT 1 AS one FROM "users" INNER JOIN "turma_users" ON "users"."id" = "turma_users"."user_id" WHERE "turma_users"."turma_id" = 6 LIMIT 1

    <div style="background: #f8f9fa; padding: 15px; border-radius: 8px; margin-bottom: 30px;">
      <% @turma.users.each do |aluno| %>
---
SELECT "users".* FROM "users" INNER JOIN "turma_users" ON "users"."id" = "turma_users"."user_id" WHERE "turma_users"."turma_id" = 6