app/views/admin/turmas/show.html.erb

      <strong>Total de Alunos:</strong>
      <span><%= @turma.users.count %></span>
---
SELECT COUNT(*) FROM "users" INNER JOIN "turma_users" ON "users"."id" = "turma_users"."user_id" WHERE "turma_users"."turma_id" = $1  [["turma_id", 13]]

  <!-- Lista de Alunos -->
  <% if @turma.users.any? %>
---
SELECT 1 AS one FROM "users" INNER JOIN "turma_users" ON "users"."id" = "turma_users"."user_id" WHERE "turma_users"."turma_id" = $1 LIMIT $2  [["turma_id", 13], ["LIMIT", 1]]