app/controllers/respondente/formularios_controller.rb

SELECT "turmas"."id" FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = $1  [["user_id", 404]]
SELECT "formularios".* FROM "formularios" WHERE "formularios"."turma_id" = $1  [["turma_id", 278]]
SELECT "formularios".* FROM "formularios"
SELECT 1 AS one FROM "respostas" WHERE "respostas"."formulario_id" = $1 AND "respostas"."user_id" = $2 LIMIT $3  [["formulario_id", 12], ["user_id", 41], ["LIMIT", 1]]
---
  def index
    # Buscar apenas formulários das turmas em que o usuário está matriculado
    turma_ids = current_user.turmas.pluck(:id)
    @formularios = Formulario.where(turma_id: turma_ids)

    # Para cada formulário, verificar se o usuário já respondeu
    @respondeu_hash = {}
    @formularios.each do |form|
      @respondeu_hash[form.id] = form.respostas.exists?(user_id: current_user.id)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 999], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = $1  [["template_id", 21]]
SELECT "respostas".* FROM "respostas" WHERE "respostas"."formulario_id" = $1 AND "respostas"."user_id" = $2  [["formulario_id", 15], ["user_id", 44]]
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "questions" WHERE "questions"."template_id" = $1 LIMIT $2  [["template_id", 1], ["LIMIT", 1]]
---
  def show
    @formulario = ::Formulario.find(params[:id])
    @perguntas = @formulario.template&.questions || []

    # Verificar se o usuário já respondeu
    @ja_respondeu = @formulario.respostas.exists?(user_id: current_user.id)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = $1 LIMIT $2  [["id", 999], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "questions" WHERE "questions"."template_id" = $1 LIMIT $2  [["template_id", 2], ["LIMIT", 1]]
---
  def submit
    @formulario = ::Formulario.find(params[:id])
    @perguntas = @formulario.template&.questions || []

    return redirect_to(respondente_formulario_path(@formulario), alert: "Você já respondeu este formulário.") if ja_respondeu?(@formulario)
    return redirect_to(respondente_formulario_path(@formulario), alert: "Formulário sem perguntas.") if @perguntas.empty?