app/controllers/respondente/formularios_controller.rb

SELECT "turmas"."id" FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = 379
SELECT "formularios".* FROM "formularios" WHERE "formularios"."turma_id" = 268
SELECT "respostas".* FROM "respostas" WHERE "respostas"."formulario_id" = 7 AND "respostas"."user_id" = 4
SELECT 1 AS one FROM "respostas" WHERE "respostas"."formulario_id" = 188 AND "respostas"."user_id" = 379 LIMIT 1
---
  def index
    # Buscar apenas formulários das turmas em que o usuário está matriculado
    turma_ids = current_user.turmas.pluck(:id)
    @formularios = Formulario.where(turma_id: turma_ids)

    # Para cada formulário, verificar se o usuário já respondeu
    @respondeu_hash = {}
    @formularios.each do |form|
      @respondeu_hash[form.id] = form.respostas.exists?(user_id: current_user.id)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 188 LIMIT 1
SELECT 1 AS one FROM "questions" WHERE "questions"."template_id" = 3 LIMIT 1
SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = 3
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 6 LIMIT 1
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 9 LIMIT 1
SELECT "respostas".* FROM "respostas" WHERE "respostas"."formulario_id" = 188 AND "respostas"."user_id" = 379
---
  def show
    @formulario = ::Formulario.find(params[:id])
    @perguntas = @formulario.template&.questions || []

    # Verificar se o usuário já respondeu
    @ja_respondeu = @formulario.respostas.exists?(user_id: current_user.id)

    # Se já respondeu, carregar as respostas existentes
    if @ja_respondeu
      @respostas_user = @formulario.respostas.where(user_id: current_user.id).index_by(&:question_id)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 188 LIMIT 1
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 254 LIMIT 1
SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = 6
SELECT 1 AS one FROM "questions" WHERE "questions"."template_id" = 254 LIMIT 1
---
  def submit
    @formulario = ::Formulario.find(params[:id])
    @perguntas = @formulario.template&.questions || []

    return redirect_to(respondente_formulario_path(@formulario), alert: "Você já respondeu este formulário.") if ja_respondeu?(@formulario)
    return redirect_to(respondente_formulario_path(@formulario), alert: "Formulário sem perguntas.") if @perguntas.empty?

SELECT 1 AS one FROM "respostas" WHERE "respostas"."formulario_id" = 188 AND "respostas"."user_id" = 379 LIMIT 1
---
  def ja_respondeu?(formulario)
    formulario.respostas.exists?(user_id: current_user.id)

INSERT INTO "respostas" ("created_at", "formulario_id", "question_id", "updated_at", "user_id", "valor") VALUES ('2025-12-12 21:06:03.129908', 188, 91, '2025-12-12 21:06:03.129908', 379, 'Muito alto') RETURNING "id"
---
  def salvar_respostas(formulario, perguntas)
    perguntas.each do |pergunta|
      valor = params["question_#{pergunta.id}"].presence
      next unless valor.present?
      resposta = formulario.respostas.build(user_id: current_user.id, question_id: pergunta.id, valor: valor)
      return false unless resposta.save