app/controllers/respondente/formularios_controller.rb

  def show
    @formulario = ::Formulario.find(params[:id])
    @perguntas = @formulario.template&.questions || []

    # Verificar se o usuário já respondeu
    @ja_respondeu = @formulario.respostas.exists?(user_id: current_user.id)
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 2 LIMIT 1