app/controllers/respondente/perfil_controller.rb

  def update_password
    @user = current_user

    unless @user.authenticate(params[:current_password])
      flash.now[:alert] = "Senha atual incorreta."
      render :edit_password, status: :unprocessable_entity
      return
    end

    if params[:new_password] != params[:password_confirmation]
      flash.now[:alert] = "A nova senha e a confirmação não coincidem."
      render :edit_password, status: :unprocessable_entity
      return
    end

    if @user.update(password: params[:new_password], password_confirmation: params[:password_confirmation])
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2025-12-14 03:42:20.797885"], ["id", 764]]