app/views/respondente/formularios/index.html.erb

              <p class="text-muted mb-1" style="font-size: 0.9rem;">
                <% if form.turma.present? %>
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]