app/views/respondente/formularios/index.html.erb

                  <%= form.turma.codigo %> - <%= form.turma.departamento %>
                  <% if form.turma.semestre.present? %>
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1

              <p class="text-muted mb-3" style="font-size: 0.85rem;">
                <% if form.turma&.professor.present? %>
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1