app/views/respondente/formularios/show.html.erb

    <%= @formulario.titulo %>
    <% if @formulario.turma.present? %>
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1