app/views/respondente/formularios/show.html.erb

    <%= @formulario.titulo %>
    <% if @formulario.turma.present? %>
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]