app/controllers/sessions_controller.rb

  def localizar_usuario(identificador)
    User.find_by("email = ? OR matricula = ?", identificador, identificador)
---
SELECT "users".* FROM "users" WHERE (email = 'aluno@teste.com' OR matricula = 'aluno@teste.com') LIMIT 1