app/controllers/sessions_controller.rb

  def create
    # Aceita email OU matrícula como identificador
    login_param = params[:login]
    user = User.find_by("email = ? OR matricula = ?", login_param, login_param)
---
SELECT "users".* FROM "users" WHERE (email = 'admin2@unb.br' OR matricula = 'admin2@unb.br') LIMIT 1