app/views/respondente/perfil/show.html.erb

SELECT "turmas".* FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = 4
---

      <% if @user.turma.present? %>

SELECT "turmas".* FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = 4
SELECT 1 AS one FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = 4 LIMIT 1
---
              <%= @user.turma.codigo %> - <%= @user.turma.departamento %>
              <% if @user.turma.semestre.present? %>