app/views/respondente/perfil/show.html.erb

SELECT 1 AS one FROM "turmas" INNER JOIN "turma_users" ON "turmas"."id" = "turma_users"."turma_id" WHERE "turma_users"."user_id" = $1 LIMIT $2  [["user_id", 760], ["LIMIT", 1]]
---

      <% if @user.turma.present? %>