app/views/admin/formularios/_form.html.erb

    <%= f.label :template_id, "Template", class: "form-label fw-semibold" %>
    <%= f.collection_select :template_id, (@templates || ::Template.all), :id, :nome, { prompt: "Selecione um template" }, class: "form-select" %>
---
SELECT "templates".* FROM "templates"

    <%= f.label :turma_id, "Turma", class: "form-label fw-semibold" %>
    <%= f.collection_select :turma_id, (@turmas || ::Turma.all), :id, :codigo, { prompt: "Selecione uma turma" }, class: "form-select" %>
---
SELECT "turmas".* FROM "turmas"