app/views/admin/formularios/_form.html.erb

SELECT "templates".* FROM "templates"
---
    <label style="font-weight: 600; display: block; margin-bottom: 8px;">Template:</label>
    <%= f.select :template_id,
          options_from_collection_for_select(@templates, :id, :nome, formulario.template_id),
          { prompt: "Selecione um template" },
          class: "form-select mb-4",
          style: "border: 1px solid #ddd; border-radius: 4px; padding: 8px;",
          required: true %>

SELECT "turmas".* FROM "turmas"
---
    <label style="font-weight: 600; display: block; margin-bottom: 8px;">Turma:</label>
    <%= f.select :turma_id,
          options_from_collection_for_select(@turmas, :id, :codigo, formulario.turma_id),
          { prompt: "Selecione uma turma" },
          class: "form-select mb-4",
          style: "border: 1px solid #ddd; border-radius: 4px; padding: 8px;",
          required: true,
          onchange: "updateTurmaInfo(this)" %>