app/views/admin/formularios/index.html.erb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1
---
        <p class="text-muted" style="margin: 0 0 4px 0; font-size: 0.9rem;">
          <% if form.turma.present? %>
            <%= form.turma.codigo %> - <%= form.turma.departamento %>
            <% if form.turma.semestre.present? %>