app/views/admin/formularios/respostas.html.erb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  <p style="color: #666; margin-bottom: 20px; font-size: 0.95rem;">
    <% if @formulario.turma.present? %>