app/views/admin/formularios/respostas.html.erb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 5 LIMIT 1
---
      <%= @formulario.turma.codigo %> - <%= @formulario.turma.departamento %>
      <% if @formulario.turma.semestre.present? %>