app/views/admin/formularios/show.html.erb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = 2 LIMIT 1
---
    - <%= @formulario.turma.codigo %>
    <% if @formulario.turma.semestre.present? %>

SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = 5
SELECT 1 AS one FROM "questions" WHERE "questions"."template_id" = 5 LIMIT 1
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 5 LIMIT 1
---

    <% if @formulario.template&.questions&.any? %>
      <% @formulario.template.questions.each do |pergunta| %>