app/views/admin/formularios/show.html.erb

SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  <%= @formulario.titulo %>
  <% if @formulario.turma.present? %>

SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT 1 AS one FROM "questions" WHERE "questions"."template_id" = $1 LIMIT $2  [["template_id", 14], ["LIMIT", 1]]
---

    <% if @formulario.template&.questions&.any? %>